"THANKS TO" = "Ευχαριστούμε τους";
"DHowett, FOR Theos AND Logos." = "Τον DHowett, για το Theos και τα λογότυπα.";
"Saurik, FOR Cydia." = "Τον Saurik, για το Cydia.";
"SPECIAL THANKS TO" = "Ειδικά ευχαριστούμε τους";
"BouchardAnthony, FOR ALL HIS SUGGESTIONS AND TESTING FOR ICAUGHTU PRO." = "BouchardAnthony, για όλες τις προτάσεις και δοκιμές του iCaughtU Pro.";
"Adam_Rotman, FOR ALL HIS TESTING." = "Adam_Rotman, για όλες τις δοκιμές.";
"iHaz3, FOR THE ICONS REALIZED FOR ICAUGHTU PRO." = "iHaz3, για τις εικόνες του iCaughtU Pro.";
"ALL MY BETA TESTERS." = "Όλους τους beta testers.";
"CREDITS" = "Συντελεστές";